app/controllers/students_controller.rb

INSERT INTO "students" ("address", "age", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "Nueva Ecija"], ["age", 20], ["created_at", Mon, 09 Dec 2013 08:04:36 UTC +00:00], ["name", "ryan"], ["updated_at", Mon, 09 Dec 2013 08:04:36 UTC +00:00]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save